---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyLineLengthParam
source: html/ae189d37-a4b9-73b5-4edb-27ea9f9d93b5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyLineLengthParam Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyLineLengthParam { get; }
```